
; ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
;                              port.asm
;							wzq
;                                                       2013/5/21
; ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


; 导出函数
global	out_byte
global	in_byte
global	io_delay

global	port_read
global	port_write

[SECTION .text]

; ========================================================================
;                  void out_byte(u16 port, u8 value);
; ========================================================================
out_byte:
	mov	edx, [esp + 4]		; port
	mov	al, [esp + 4 + 4]	; value
	out	dx, al
	nop	; 一点延迟
	nop
	nop
	ret

; ========================================================================
;                  u8 in_byte(u16 port);
; ========================================================================
in_byte:
	mov	edx, [esp + 4]		; port
	xor	eax, eax
	in	al, dx
	nop	; 一点延迟
	nop
	nop
	ret

; ========================================================================
;                  void io_delay();
; ========================================================================
io_delay:
	nop
        nop
	nop	
	nop
	ret
; ========================================================================
;                  void port_read(u16 port, void* buf, int size);
; ========================================================================
port_read:
	mov	edx, [esp + 4]		; port
	mov	edi, [esp + 4 + 4]	; buf
	mov	ecx, [esp + 4 + 4 + 4]	; size
	shr	ecx, 1			; size的单位是字节，复制的单位是字
	cld				; 清方向标志DF=0
	rep	insw
	ret

; ========================================================================
;                  void port_write(u16 port, void* buf, int size);
; ========================================================================
port_write:
	mov	edx, [esp + 4]		; port
	mov	esi, [esp + 4 + 4]	; buf
	mov	ecx, [esp + 4 + 4 + 4]	; size
	shr	ecx, 1			; size的单位是字节，复制的单位是字
	cld				; 清方向标志DF=0
	rep	outsw
	ret

