
; ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
;                               syscall.asm
;						      wzq
;                                                     2013/6/10
; ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
;; 所有的系统调用的入口函数，我想都应该放在这里...
	

%include "k_const.inc"

;; 导出符号，对于汇编函数，我们约定第一个字符是下划线
global	_sendrecv

[section .text]

; ====================================================================================
;                  int _sendrecv(int function, MESSAGE* msg);
; ====================================================================================
_sendrecv:
	mov	eax, NB_sendrecv
	mov	ebx, [esp + 4]
	mov	ecx, [esp + 8]

	int	INT_VEC_SYSCALL
	ret
